Conf.Simple/src/InformationRegisters/SUI_СообщенияМобильныхУстройств/SUI_СообщенияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияМобильныхУстройств</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СообщенияМобильныхУстройств/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Запись.Отправитель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел();
		Запись.Получатель = SUI_МобильныеУстройстваСервер.МобильноеУстройствоФильтр(
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Получатель"));

	КонецЕсли;

	ПереопределитьКнопкиПриСоздании(Отказ);

	ОбновитьВидимостьИДоступностьЭлементов();
	
	Если ЗначениеЗаполнено(Запись.Получатель) Тогда
		Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
			Элементы.Получатель.ТолькоПросмотр = Истина;
		КонецЕсли;
		Элементы.Сообщение.АктивизироватьПоУмолчанию = Истина;
	Иначе
		Элементы.Получатель.АктивизироватьПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		ДанныеЗаписи = РегистрыСведений.SUI_СообщенияМобильныхУстройств.СформироватьДанныеЗаписи(
			Запись.Отправитель, Запись.Получатель);
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, ДанныеЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьИДоступностьЭлементов()
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Элементы.ГруппаСлужебныеРеквизиты.Доступность = Ложь;
		
		Если Запись.Отправитель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
			Элементы.Отправитель.Видимость = Ложь;
			Элементы.Отправитель.ТолькоПросмотр = Истина;
		Иначе
			Элементы.Отправитель.Видимость = Истина;
			Элементы.Отправитель.ТолькоПросмотр = Ложь;
		КонецЕсли;

		Элементы.Получатель.ТолькоПросмотр 	= Ложь;
		Элементы.Сообщение.ТолькоПросмотр 	= Ложь;
		
	Иначе
		
		Элементы.ГруппаСлужебныеРеквизиты.Доступность 	= Истина;
		Элементы.Отправитель.Видимость 					= Истина;
		Элементы.Отправитель.ТолькоПросмотр 			= Истина;
		Элементы.Получатель.ТолькоПросмотр 				= Истина;
		Элементы.Сообщение.ТолькоПросмотр 				= Истина;
		
		КнопкаЗаписатьИЗакрыть = ЭлементКнопкаЗаписатьИЗакрыть();
		Если КнопкаЗаписатьИЗакрыть <> Неопределено Тогда
			КнопкаЗаписатьИЗакрыть.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭлементКоманднаяПанель(Отказ = Неопределено)
	
	ЭлементКоманднаяПанель = Элементы.Найти("ФормаКоманднаяПанель");
	
	Если ЭлементКоманднаяПанель = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось определить командную панель формы.'"), , , , Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЭлементКоманднаяПанель;

КонецФункции

&НаСервере
Функция ЭлементКнопкаЗаписатьИЗакрыть(Отказ = Неопределено)
	
	ЭлементКоманднаяПанель = ЭлементКоманднаяПанель(Отказ);
	
	КнопкаЗаписатьИЗакрыть = ЭлементКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаЗаписатьИЗакрыть");
	
	Если КнопкаЗаписатьИЗакрыть = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'В командной панели формы отсутствует кнопка ""Записать и закрыть"".'"), , , , Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат КнопкаЗаписатьИЗакрыть;
	
КонецФункции

&НаСервере
Процедура ПереопределитьКнопкиПриСоздании(Отказ)
	
	КнопкаЗаписатьИЗакрыть = ЭлементКнопкаЗаписатьИЗакрыть(Отказ);
	
	Если КнопкаЗаписатьИЗакрыть <> Неопределено Тогда
		КнопкаЗаписатьИЗакрыть.Заголовок = "Отправить и закрыть";
		КнопкаЗаписатьИЗакрыть.Картинка = БиблиотекаКартинок.ОтправитьСообщение;
		КнопкаЗаписатьИЗакрыть.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КнопкаЗаписатьИЗакрыть.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
